#include <iostream>
//Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони
// (N не е поголемо од 50). Програмата треба да ја трансформира вчитаната матрица во нова матрица B,
// така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица, односно од матрица
// со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

//Input
// 4
// 81  29  53  46  45  100  84  75
// 19  87  45  38  3  87  10  53
// 84  45  50  13  40  30  50  25
// 39  30  89  5  57  58  7  79
//Output
// 81 29 53 46
// 19 87 45 38
// 84 45 50 13
// 39 30 89 5
// 45 100 84 75
// 3 87 10 53
// 40 30 50 25
// 57 58 7 79
int main() {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}
