#include <iostream>
//Во една компанија сите вработени користат еден централизиран систем, за кој им е креирана корисничка сметка.
// Корисничко име(username) на секој вработен се добива откако од матичниот број на вработениот ќе се земат деловите кои го
// даваат датумот на раѓање и ќе се пресмета вредноста:
//
//    ден * 100 + месец * 1000 + година
//
//Така ако делот од матичниот број кој го дава датумот е 1103998, тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.
//
//Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.
//
//Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:
//
//    7 - доколку годината на раѓање е до 1960
//    8 - доколку годината на раѓање е помеѓу 1961 - 1980
//    9 - доколку годината на раѓање е помеѓу 1981 - 1999
//
//Напомена: Се смета дека сите вработени се родени до 1999 година.
//
//Програмата го враќа ваквото корисничко име за внес од тастатура кој е дел од матичниот број на некој вработен, како во примерот.

//Input
//0112998
//Output
//14098

//Input
//0101999
//Output
//93099

//Input
//0705950
//Output
//77650


using namespace std;

int main() {

    //0112998
    int matichen;
    cin >> matichen;

    int den = matichen / 100000; // 01
    int mesec = (matichen / 1000) % 100; // 12
    int godina = (matichen % 1000) + 1000; // 998

    int username = den * 100 + mesec * 1000 + godina;

    if (username >= 10000 && username <= 99999) {
        cout << username;
    } else {
        if (godina <= 1960) {
            cout << "7" << username;
        } else if (godina >= 1961 && godina <= 1980) {
            cout << "8" << username;
        } else if (godina >= 1981 && godina <= 1999) {
            cout << "9" << username;
        }
    }
    return 0;
}
