#include <iostream>
//Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви, која се чита во продолжение.
// Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати должината на најдолгата строго растечка подниза,
// доколку матрицата ја гледаме ред по ред.
//
//На пример, ако е дадена следната матрица:
//
//1 2 3 9 8
//5 5 5 5 5
//0 1 2 0 0
//9 1 2 3 4
//1 1 1 1 1
//
//должината на најдолгата строго растечка подниза е 4, а тоа е должината на поднизата 1 2 3 4, во четвртиот ред.

//Input
//7
//0 0 0 0 0 0 0
//0 0 0 0 0 0 0
//1 1 1 1 1 1 1
//2 2 2 2 2 2 2
//8 8 8 8 8 8 8
//6 6 6 6 6 6 6
//0 0 0 0 0 0 0
//Output
//1

using namespace std;

int main() {
    int n;
    cin >> n;

    int matrix[n][n];

    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            cin >> matrix[i][j];
        }
    }

    int max = 1;
    for (int i = 0; i < n; i++) {
        int counter = 1;
        for (int j = 0; j < n; j++) {
            if (matrix[i][j] < matrix[i][j + 1]) {
                counter++;
            } else {
                if (counter > max) {
                    max = counter;
                    counter = 1;
                }
            }
        }
    }

    cout << max;
    return 0;
}
