#include <iostream>

// Да се напише рекурзивна функција која што прима еден аргумент - број x која што ќе враќа
// 1 доколку секоја цифра
// во бројот е поголема од претходната, а во спротивно0.
//
// Пример бројот 12345 е растечки, додека пак бројот 12325 не е растечки број.
//
// Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати
// порака DA или NE (во нов ред),
// доколку бројот е растечки или не е растечки.

//Input
//100
//5080 8757 8324 4766 5733 5454 9842 6342 1569 1062 9723 1125 230 3680 195 8776 6580 9836 3902 5793 1642 5914 2431 4448 2769 9392 6396 6458 1602 6003 6637 5368 2200 6805 1844 9534 8160 508 7174 5462 7437 8635 4103 2104 3752 3487 2004 3385 6340 680 170 3502 6095 4306 4676 8459 4837 3007 2897 7436 3519 5523 6948 5374 4713 9691 8917 1931 3792 3962 6885 7297 3770 1090 799 9934 3664 9163 553 154 1510 7540 442 2801 5932 4499 341 8924 9997 938 2244 5002 260 648 3200 8528 2030 9961 2348 138
//Output
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//DA
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//NE
//DA
//DA

using namespace std;

int recursive(int broj) {
    if (broj < 10) {
        return 1;
    }

    if (broj % 10 > broj % 100 / 10) {
        return recursive(broj / 10);
    }

    return 0;
}

int main() {
    int n;
    cin >> n;

    for (int i = 0; i < n; i++) {
        int broj;
        cin >> broj;

        if (recursive(broj)) {
            cout << "DA" << endl;
        } else {
            cout << "NE" << endl;
        }
    }
    return 0;
}
