#include <iostream>

/*Да се напише програма која ќе ја отпечати поднизата на дадена текстуална
низа (што се внесува од тастатура) определена со позицијата и должината, што
како параметри се внесуваат од тастатура. Поднизата започнува од знакот што
се наоѓа на соодветната позиција во текстуалната низа, броејќи од лево.
Пример
Ако од тастатура се внесе:
banana
позиција: 3
должина: 4
тогаш програмата треба да отпечати: nana*/
using namespace std;

int main() {
    char str[100];
    cin.getline(str, 100);

    int position;
    cin >> position;

    int length;
    cin >> length;

    for (int i = position - 1; i < position - 1 + length; i++) {
        if (str[i] == '\0') {
            break;
        }

        cout << str[i];
    }
    return 0;
}
