#include <iostream>

using namespace std;

//Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
//
//Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
// По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа,
// а истото важи и за редоследот на негативните.
//
//Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.
//
//Пример.
//
//Влез
//
//9 // бројот N на елементи
//
//1 3 -3 2 5 -7 9 0 3 // елементи на низата
//
//
//Излез
//
//1 3 2 5 9 0 3 -3 -7 // добиената низа, после преместувањето
void premesti(int *arr, int n) {
    int tmp[100];
    int counter = 0;

    for (int i = 0; i < n; i++) {
        if (arr[i] >= 0) {
            tmp[counter++] = arr[i];
        }
    }

    for (int i = 0; i < n; i++) {
        if (arr[i] < 0) {
            tmp[counter++] = arr[i];
        }
    }

    for (int i = 0; i < n; i++) {
        arr[i] = tmp[i];
    }
}

int main() {
    int n;
    cin >> n;
    int array[100];

    for (int i = 0; i < n; i++) {
        cin >> array[i];
    }

    premesti(array, n);

    for (int i = 0; i < n; i++) {
        cout << array[i] << " ";
    }

    return 0;
}