#include <iostream>
using namespace std;
//Да се напише програма која што од стандарден влез ќе вчитува 3 знаци и истите ќе ги шифрира во две секвенции од бинарни броеви (1/0) со должина 3.
//
//Шифрирањето треба да се одвива на следниот начин:
//
//    во првата бинарна секвенца, за секој еден знак да се испечати 0 доколку знакот е некој специјален знак, а 1 во спротивно.
//    во втората бинарна секвенца, за секој еден знак да се испечати 0 доколку знакот е буква, а 1 во спротивно.
//
//Пример: Влез:
//
// / * 1
//
//Излез:
//
//001
//111
int main() {
    char znak1, znak2, znak3;
    cin >> znak1 >> znak2 >> znak3;

    if(znak1 >= 33 && znak1 <= 47 || znak1 >= 58 && znak1 <= 64 || znak1 >= 91 && znak1 <= 96
            || znak1 >= 123 && znak1 <= 126) {
        cout << "0";
    } else {
        cout << "1";
    }
    if(znak2 >= 33 && znak2 <= 47 || znak2 >= 58 && znak2 <= 64 || znak2 >= 91 && znak2 <= 96
       || znak2 >= 123 && znak2 <= 126) {
        cout << "0";
    } else {
        cout << "1";
    }
    if(znak3 >= 33 && znak3 <= 47 || znak3 >= 58 && znak3 <= 64 || znak3 >= 91 && znak3 <= 96
       || znak3 >= 123 && znak3 <= 126) {
        cout << "0";
    } else {
        cout << "1";
    }

    cout << endl;

    if(znak1 >= 65 && znak1 <= 90 || znak1 >= 97 && znak1 <= 122) {
        cout << "0";
    } else {
        cout << "1";
    }
    if(znak2 >= 65 && znak2 <= 90 || znak2 >= 97 && znak2 <= 122) {
        cout << "0";
    } else {
        cout << "1";
    }
    if(znak3 >= 65 && znak3 <= 90 || znak3 >= 97 && znak3 <= 122) {
        cout << "0";
    } else {
        cout << "1";
    }
    return 0;
}
